In [1]:
import numpy as np
import pandas as pd

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [13]:
df['col2'].unique()

array([444, 555, 666])

In [15]:
np.unique(df['col2'])

array([444, 555, 666])

In [18]:
len(df['col2'].unique())

3

In [23]:
df['col2'].nunique() # Igual ao de cima

3

In [26]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [33]:
df[(df['col2']>2) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [34]:
def vezes2(x):
    return x*2

In [36]:
vezes2(2)

4

In [38]:
df.apply(vezes2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [41]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [54]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [60]:
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [62]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [64]:
del(df['col2'])
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [71]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [72]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [81]:
df.sort_values(by='col1', ascending=False)

   col1 col3
3     4  xyz
2     3  ghi
1     2  def
0     1  abc

In [88]:
df.isnull()

    col1   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [91]:
df.dropna() # Remove as linhas que tenham nan

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [92]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [102]:
df.fillna(method='ffill').fillna('A')

   col1 col2 col3
0   1.0    A  abc
1   2.0  555  def
2   3.0  666  ghi
3   3.0  444  xyz

In [110]:
df['col1'].fillna(df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [117]:
np.array([1,2,3]).mean()

2.0

In [123]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [134]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [135]:
df.replace(['one', 'two'], [1,2])

     A  B  C  D
0  foo  1  x  1
1  foo  1  y  3
2  foo  2  x  2
3  bar  2  y  5
4  bar  1  x  4
5  bar  1  y  1